20240810T122445--kdoc-217-『基礎からきっちり覚える-機械語入門』__book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-20T22:05:15Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 217: 『基礎からきっちり覚える 機械語入門』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 217: 『基礎からきっちり覚える 機械語入門』</h1>
<div id="outline-container-orge38eeba" class="outline-2">
<h2 id="orge38eeba"><a href="#orge38eeba">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orge38eeba">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-10-27 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-10-28 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd23dc38" class="outline-2">
<h2 id="orgd23dc38"><a href="#orgd23dc38">概要</a></h2>
<div class="outline-text-2" id="text-orgd23dc38">
<p>
<a href="https://www.amazon.co.jp/gp/product/B00JXBRF5U/ref=ppx_yo_dt_b_d_asin_title_351_o00?ie=UTF8&amp;psc=1">基礎からきっちり覚える 機械語入門</a>は、機械語を一般の人向けに解説する本。
</p>
</div>
</div>
<div id="outline-container-orgae46203" class="outline-2">
<h2 id="orgae46203"><a href="#orgae46203">メモ</a></h2>
<div class="outline-text-2" id="text-orgae46203">
<ul class="org-ul">
<li>コンピュータがどのように動作するかというイメージを掴むためには、実は機械語を見てみるのが一番の早道である。機械語の動作が理解できれば、その上で動く高級言語やOSなどの動作も非常にわかりやすくなる、という</li>
<li>10進2進16進対応表(p44)</li>
<li>除算というのは負荷の大きな演算であり、加算などの演算に比べると、実行に要する時間がはるかに長い(p51)</li>
<li>CPUの処理がもっとも効率よく行われるのはバイト、ワード、ダブルワードの各データ型に対してである(p55)</li>
<li>説明用の機械語を定義している。レジスタはなく、すべてメモリで制御する</li>
<li>値ではなく、そのアドレスの値を参照する命令がある。なぜ間接参照が必要なのかというと、この機能がないとあらかじめ分かっている番地にしかデータを書けないから。たとえば、ユーザの入力はあらかじめわからない。間接参照があると、入力した値をメモリに保管しておけば、あとはそのメモリを参照して使える(p136)</li>
<li>値X、X番地の値、X番地が指す値(X番地にある値をアドレスとみなし、その番地の中身に書かれている値)の3つ
<ul class="org-ul">
<li>即値、直接参照、間接参照</li>
</ul></li>
<li>排他的論理和は片方だけが真のときのみ全体が真になる論理演算。「私はAまたはBどちらかと結婚します」というような場合。両方は犯罪となる</li>
<li>とてもシンプルな命令の組み合わせで表現できるのを示している</li>
<li>当たり前と考えているプログラミングの概念がなぜあるかを、機械語の面から見て解説している。変数や、型
<ul class="org-ul">
<li>機械語ではデータはすべて数字なのだから、演算できてしまう。なので型が必要</li>
<li>アドレスを人間が管理するのは認識の面と、ズレるので大変である。なので変数が必要</li>
</ul></li>
<li>昔はNOP命令すなわち「何もしない命令」が重要だった。プログラムを組む際にあらかじめ途中にこの命令を10個ずつくらい挟んでおく。処理を追加しても、その後の番地をすべて変更しなくてよい(p207)</li>
<li>変数の型という概念。そのアドレスから始まるデータがどのような目的に使われ、どのような構造を持っているのかを定義したもの(p219)</li>
<li>機械語レベルではすべて数値であるために、論理的におかしな計算でもできてしまう。型があると書いた時点でエラーを出せる(p222)</li>
<li>関数とはパラメータで指定された変数に対してあるプログラムを適用して得られた結果を返すもの。プロシージャとは関数と同じだが結果を返さないもの(p243)
<ul class="org-ul">
<li>プロシージャの例: メモリのある領域を全部0で埋め尽くす、など</li>
</ul></li>
<li>プログラムというのは各ステップごとに内部の状態が変わるが、その状態は2のN乗種類しかない(p323)</li>
</ul>
</div>
</div>
<div id="outline-container-orga12c469" class="outline-2">
<h2 id="orga12c469"><a href="#orga12c469">関連</a></h2>
<div class="outline-text-2" id="text-orga12c469">
<ul class="org-ul">
<li><a href="20240831T112344--kdoc-232-『たのしいバイナリの歩き方』__book.html#ID-20240831T112344">KDOC 232: 『たのしいバイナリの歩き方』</a>。バイナリつながり</li>
</ul>
</div>
</div>
<div id="outline-container-orge958b8c" class="outline-2">
<h2 id="orge958b8c"><a href="#orge958b8c">Backlinks</a></h2>
<div class="outline-text-2" id="text-orge958b8c">
<ul class="org-ul">
<li><a href="./20240919T002306--kdoc-243-シフト演算命令に変換されるのを確かめる__wiki.html">KDOC 243: シフト演算命令に変換されるのを確かめる</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
